import cookies from '../methods/cookies';
import '../scss/userinfo.scss'
import Router from 'next/router'

export default class UserInfo extends React.Component{

    constructor(props){
        super(props);

        this.state = {
            toggle : false
        }

        this.clickToggle = this.clickToggle.bind(this);
    }

    clickToggle(){
        this.setState({
            toggle : !this.state.toggle
        })
    }

    handleClickLogout(){
        cookies.setCookie('history', window.location.pathname)
        Router.push("/logout");
    }

    render(){
        return (
            <div className = "userinfo">
                <div className ="userinfo-profile">
                    <img className = "userinfo-profile-img" src = {this.props.profile}></img>
                </div>

                <div className = "userinfo-topdown-button" onClick = {() => this.clickToggle()}>
                    <svg xmlns="http://www.w3.org/2000/svg" width="20" height="10" viewBox="0 0 20 10">
                    <g id="다각형_1" data-name="다각형 1" transform="translate(20 10) rotate(180)">
                        <path d="M 17.58579063415527 9.500001907348633 L 2.414210081100464 9.500001907348633 C 2.104219913482666 9.500001907348633 1.982270002365112 9.263751983642578 1.952270030975342 9.191341400146484 C 1.922279953956604 9.118942260742188 1.841459989547729 8.865652084350586 2.060659885406494 8.646441459655762 L 9.646439552307129 1.060661792755127 C 9.740880012512207 0.966221809387207 9.866450309753418 0.9142118096351624 10 0.9142118096351624 C 10.13356018066406 0.9142118096351624 10.25911998748779 0.966221809387207 10.35356044769287 1.060661792755127 L 17.93934059143066 8.646441459655762 C 18.15854072570801 8.865652084350586 18.07772064208984 9.118942260742188 18.0477294921875 9.191341400146484 C 18.01773071289063 9.263751983642578 17.89578056335449 9.500001907348633 17.58579063415527 9.500001907348633 Z" stroke="none"/>
                        <path d="M 10 1.414212226867676 L 2.414220809936523 9.000001907348633 C 2.414220809936523 9.000001907348633 2.414220809936523 9.000001907348633 2.414209365844727 9.000001907348633 L 17.58577919006348 9.000001907348633 L 10.00096035003662 1.414291381835938 C 10.0008602142334 1.414271354675293 10.0004997253418 1.414212226867676 10 1.414212226867676 M 10 0.4142122268676758 C 10.25592231750488 0.4142122268676758 10.51184463500977 0.5118417739868164 10.70711040496826 0.7071018218994141 L 18.29289054870605 8.292891502380371 C 18.92285919189453 8.92286205291748 18.4766902923584 10.00000190734863 17.58579063415527 10.00000190734863 L 2.414209365844727 10.00000190734863 C 1.523309707641602 10.00000190734863 1.077140808105469 8.92286205291748 1.707109451293945 8.292891502380371 L 9.292889595031738 0.7071018218994141 C 9.488155364990234 0.5118417739868164 9.744077682495117 0.4142122268676758 10 0.4142122268676758 Z" stroke="none"/>
                    </g>
                    </svg>
                </div>

                <div className = {"userinfo-detail userinfo-detail-" + (this.state.toggle ? 'on' : 'off') }>
                    <div className = "userinfo-login-button button"
                        onClick = {() => this.handleClickLogout()}>
                        로그아웃
                    </div>

                </div>
            </div>
        )
    }
}